package a08regexdemo1;
//正则表达式
public class RegexDemo2 {
    public static void main(String[] args) {
        //410225 2002 10 10 3050
        //前面6位,第一位不是0,其他是任意数字    [1-9]\\d{5}
        //年的前半段 18 19 20 (18|19|20)
        //年的后半段  任意两数字   \\d{2}
        //月份 01-09  10 11 12  (0[1-9]|1[0-2])
        //日期 01-09 10-19 20-29 30 31 (0[1-9]|[1-2]\\d|3[0-1])
        //最后四位 任意数字出现3次 最后一位可以是数字可以是x大小写 \\d{3}[\\dXx]
        String regex="[1-9]\\d{5}(18|19|20)\\d{2}(0\\d|10|11|12)(0[1-9]|[1-2]\\d|30|31)\\d{3}[\\dXx]";
        System.out.println("410225200210103050".matches(regex));

    }
}
